In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1= {
    "name":['A','B','C','D','E'],
    "marks":[10,20,30,40,50],
    "class":[1,3,5,7,9]
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

  name  marks  class
0    A     10      1
1    B     20      3
2    C     30      5
3    D     40      7
4    E     50      9

In [5]:
df.to_csv('abc.csv')

In [6]:
df.describe()

           marks     class
count   5.000000  5.000000
mean   30.000000  5.000000
std    15.811388  3.162278
min    10.000000  1.000000
25%    20.000000  3.000000
50%    30.000000  5.000000
75%    40.000000  7.000000
max    50.000000  9.000000